#include<vector>
using namespace std;

// 选择排序：性质：1、时间复杂度：O(n2)     2、空间复杂度：O(1)     3、非稳定排序   4、原地排序
// 冒泡排序：性质：1、时间复杂度：O(n2)     2、空间复杂度：O(1)     3、稳定排序     4、原地排序
// 插入排序：性质：1、时间复杂度：O(n2)     2、空间复杂度：O(1)     3、稳定排序     4、原地排序
// 希尔排序：性质：1、时间复杂度：O(nlogn)  2、空间复杂度：O(1)     3、非稳定排序   4、原地排序
// 归并排序：性质：1、时间复杂度：O(nlogn)  2、空间复杂度：O(n)     3、稳定排序     4、非原地排序
// 快速排序：性质：1、时间复杂度：O(nlogn)  2、空间复杂度：O(logn)  3、非稳定排序   4、原地排序
// 基数排序：性质：1、时间复杂度：O(kn)     2、空间复杂度：O(n+k)   3、稳定排序     4、非原地排序
// 计数排序：性质：1、时间复杂度：O(n+k)    2、空间复杂度：O(k)     3、稳定排序     4、非原地排序
// 桶排序：  性质：1、时间复杂度：O(nlogn)  2、空间复杂度：O(1)     3、非稳定排序   4、原地排序
// 堆排序：  性质：1、时间复杂度：O(nlogn)  2、空间复杂度：O(1)     3、非稳定排序   4、原地排序



